In [34]:
import numpy as np
import pandas as pd

student_perfomance = pd.read_csv('https://stepik.org/media/attachments/course/4852/StudentsPerformance.csv')

student_perfomance = student_perfomance.rename(columns = {
    "math score":"math_score",
    "reading score":"reading_score",
    "writing score":"writing_score"
})
student_perfomance.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [15]:
student_perfomance.groupby("race/ethnicity", as_index=False).aggregate({"lunch":"max","math_score":"mean"})a

  race/ethnicity     lunch  math_score
0        group A  standard   61.629213
1        group B  standard   63.452632
2        group C  standard   64.463950
3        group D  standard   67.362595
4        group E  standard   73.821429

In [18]:
student_perfomance.groupby(["gender","race/ethnicity"]).aggregate({"lunch":"max","math_score":"mean"})

                          lunch  math_score
gender race/ethnicity
female group A         standard   58.527778
       group B         standard   61.403846
       group C         standard   62.033333
       group D         standard   65.248062
       group E         standard   70.811594
male   group A         standard   63.735849
       group B         standard   65.930233
       group C         standard   67.611511
       group D         standard   69.413534
       group E         standard   76.746479

In [22]:
#Choose five the best boys and girls in Math
student_perfomance.sort_values(['gender','math_score'], ascending=[True,False]).groupby('gender').head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math_score,reading score,writing score
451,female,group E,some college,standard,none,100,92,97
458,female,group E,bachelor's degree,standard,none,100,100,100
962,female,group E,associate's degree,standard,none,100,100,100
114,female,group E,bachelor's degree,standard,completed,99,100,100
263,female,group E,high school,standard,none,99,93,90
149,male,group E,associate's degree,free/reduced,completed,100,100,93
623,male,group A,some college,standard,completed,100,96,86
625,male,group D,some college,standard,completed,100,97,99
916,male,group E,bachelor's degree,standard,completed,100,100,100
306,male,group E,some college,standard,completed,99,87,81

In [33]:
student_perfomance.groupby('gender')[['math_score']].mean()
student_perfomance.groupby('gender')[['math_score']].mean()

        math_score
gender
female   63.633205
male     68.728216

In [35]:
# Adding and deleting of columns 
student_perfomance['total_score'] = student_perfomance.math_score + student_perfomance.writing_score +student_perfomance.reading_score

In [38]:
student_perfomance = student_perfomance.assign(total_score_log = np.log(student_perfomance.total_score))

In [39]:
student_perfomance.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math_score,reading_score,writing_score,total_score,total_score_log
0,female,group B,bachelor's degree,standard,none,72,72,74,218,5.384495
1,female,group C,some college,standard,completed,69,90,88,247,5.509388
2,female,group B,master's degree,standard,none,90,95,93,278,5.627621
3,male,group A,associate's degree,free/reduced,none,47,57,44,148,4.997212
4,male,group C,some college,standard,none,76,78,75,229,5.433722

In [43]:
student_perfomance = student_perfomance.drop(['total_score','lunch'],axis = 1)

In [57]:
student_perfomance.head()
#End of theory !!!!!!!!!!!!!!!!!!!!!!!

,gender,race/ethnicity,parental level of education,test preparation course,math_score,reading_score,writing_score,total_score_log
0,female,group B,bachelor's degree,none,72,72,74,5.384495
1,female,group C,some college,completed,69,90,88,5.509388
2,female,group B,master's degree,none,90,95,93,5.627621
3,male,group A,associate's degree,none,47,57,44,4.997212
4,male,group C,some college,none,76,78,75,5.433722

In [ ]:
#dota legs

In [46]:
dota_db = pd.read_csv("dota_hero_stats.csv")
dota_db.head()

,Unnamed: 0,attack_type,id,legs,localized_name,name,primary_attr,roles
0,0,Melee,1,2,Anti-Mage,npc_dota_hero_antimage,agi,"['Carry', 'Escape', 'Nuker']"
1,1,Melee,2,2,Axe,npc_dota_hero_axe,str,"['Initiator', 'Durable', 'Disabler', 'Jungler']"
2,2,Ranged,3,4,Bane,npc_dota_hero_bane,int,"['Support', 'Disabler', 'Nuker', 'Durable']"
3,3,Melee,4,2,Bloodseeker,npc_dota_hero_bloodseeker,agi,"['Carry', 'Disabler', 'Jungler', 'Nuker', 'Ini..."
4,4,Ranged,5,2,Crystal Maiden,npc_dota_hero_crystal_maiden,int,"['Support', 'Disabler', 'Nuker', 'Jungler']"

In [48]:
dota_db.groupby("legs").count()

      Unnamed: 0  attack_type  id  localized_name  name  primary_attr  roles
legs
0             11           11  11              11    11            11     11
2             95           95  95              95    95            95     95
4              7            7   7               7     7             7      7
6              3            3   3               3     3             3      3
8              1            1   1               1     1             1      1

In [56]:
dota_db.groupby(["attack_type",'primary_attr'])['id'].count()

attack_type  primary_attr
Melee        agi             19
             int              2
             str             35
Ranged       agi             18
             int             40
             str              3
Name: id, dtype: int64

In [49]:
#lupa and Pupa
df_lupa = pd.read_csv("accountancy.csv")
df_lupa.head()

   Unnamed: 0 Executor Type  Salary
0           0     Pupa    D      63
1           1     Pupa    A     158
2           2     Pupa    D     194
3           3     Pupa    E     109
4           4    Loopa    E     184

In [53]:
df_lupa.groupby(["Type", "Executor"])['Salary'].mean()

Type  Executor
A     Loopa        58.000000
      Pupa        160.833333
B     Loopa       145.166667
      Pupa         77.000000
C     Loopa       154.333333
      Pupa         74.500000
D     Loopa       137.714286
      Pupa        146.500000
E     Loopa       164.000000
      Pupa        131.200000
F     Loopa       238.000000
      Pupa        136.250000
Name: Salary, dtype: float64

In [83]:
df_seaweed = pd.read_csv("algae.csv")
df_seaweed.head()

,species,genus,group,sucrose,alanin,citrate,glucose,oleic_acid
0,Fucus_vesiculosus,Fucus,brown,3.001472,3.711498,5.004262,2.548459,6.405165
1,Saccharina_japonica,Saccharina,brown,6.731070,1.255251,5.621499,6.013219,4.156700
2,Fucus_serratus,Fucus,brown,3.276870,0.346431,1.216767,3.623225,0.304573
3,Fucus_distichus,Fucus,brown,6.786996,6.641303,6.423606,2.272724,3.393203
4,Cladophora_fracta,Cladophora,green,3.861470,1.648450,6.940588,2.316955,2.528886

In [82]:
df_seaweed.groupby('genus').agg(['min', 'mean', 'max']).loc['Fucus','alanin']

min     0.346431
mean    3.566411
max     6.641303
Name: Fucus, dtype: float64

In [91]:
df_seaweed.groupby("group")['species'].count()

group
brown    6
green    3
red      1
Name: species, dtype: int64

In [98]:
df_seaweed.groupby('group').agg(np.ptp).loc[:,'glucose']

group
brown    3.740495
green    1.026753
red      0.000000
Name: glucose, dtype: float64

In [99]:
df_seaweed.groupby('group').agg("var")

        sucrose    alanin   citrate   glucose  oleic_acid
group
brown  5.459098  7.220351  5.468942  1.767756    4.385233
green  2.672626  7.059917  3.950113  0.266265    0.540388
red         NaN       NaN       NaN       NaN         NaN